Reports/СправкаРасчетПереоценкаВалютныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>СправкаРасчетПереоценкаВалютныхСредств</Name>
			<Comment>(регл)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Comment>1 - БУ, 2 - НУ, 3 - БУ, ПР, ВР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраняемыеРеквизиты</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьИнуюНастройку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/РасчетПереоценкиВалютныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РасчетПереоценкиВалютныхСредств</Name>
			<Comment>Расчет переоценки валютных средств</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВГривнах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсПереоценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/СправкаРасчетПереоценкаВалютныхСредств/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
	Перем НП Экспорт;
	
	Функция СформироватьТекстЗапроса()
		
		Текст	= "ВЫБРАТЬ РАЗЛИЧНЫЕ
		     	  |	РасчетПереоценкиВалютныхСредств.ПериодРасчета КАК Период,
		     	  |	РасчетПереоценкиВалютныхСредств.Счет КАК СчетУчета,
		     	  |	РасчетПереоценкиВалютныхСредств.Валюта КАК Валюта,
		     	  |	РасчетПереоценкиВалютныхСредств.Субконто1,
		     	  |	РасчетПереоценкиВалютныхСредств.Субконто2,
		     	  |	РасчетПереоценкиВалютныхСредств.Субконто3,
		     	  |	ЕСТЬNULL(РасчетПереоценкиВалютныхСредств.СуммаВВалюте, 0) КАК СуммаВВалюте,
		     	  |	ЕСТЬNULL(РасчетПереоценкиВалютныхСредств.СуммаВГривнах, 0) КАК СуммаВГривнах,
		     	  |	ЕСТЬNULL(РасчетПереоценкиВалютныхСредств.КурсПереоценки, 0) КАК КурсПереоценки,
		     	  |	ЕСТЬNULL(РасчетПереоценкиВалютныхСредств.Сумма, 0) КАК Сумма
		     	  |ИЗ
		     	  |	РегистрСведений.РасчетПереоценкиВалютныхСредств КАК РасчетПереоценкиВалютныхСредств
		     	  |ГДЕ
		     	  |	РасчетПереоценкиВалютныхСредств.ПериодРасчета МЕЖДУ &ДатаНач И &ДатаКон
		     	  |	И РасчетПереоценкиВалютныхСредств.Организация = &Организация
		     	  |	И РасчетПереоценкиВалютныхСредств.Активность
		     	  |	И РасчетПереоценкиВалютныхСредств.ПериодРасчета МЕЖДУ &ДатаНач И &ДатаКон
		     	  |
		     	  |УПОРЯДОЧИТЬ ПО
		     	  |	Период,
		     	  |	СчетУчета
		     	  |ИТОГИ
		     	  |	СУММА(Сумма)
		     	  |ПО
		     	  |	Период,
		     	  |	СчетУчета,
		     	  |	Валюта";
		
		Возврат Текст;
		
	КонецФункции
	
	// Выполняет запрос и формирует табличный документ-результат отчета
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	// Параметры:
	//	ДокументРезультат - табличный документ, формируемый отчетом
	//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета
	//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках 
	//
	Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь, НачалоПодписи, ПоказыватьПодписи) Экспорт
		
		НачалоПериода = НачалоДня(ДатаНач);
		КонецПериода  = КонецДня(ДатаКон);
		
		ДокументРезультат.Очистить();
		
		Макет      = ПолучитьМакет("Отчет");
		// 37490 <<
		КодЯзыкаПечать = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
		Макет.КодЯзыкаМакета = КодЯзыкаПечать;
		// 37490 >>
		МакетОбщий = ПолучитьОбщийМакет("СправкаРасчет");
		// 37490 <<
		МакетОбщий.КодЯзыкаМакета = КодЯзыкаПечать;
		// 37490 >>
		
		ЗаголовокОтчета = МакетОбщий.ПолучитьОбласть("Заголовок");
		ШапкаОтчета     = Макет.ПолучитьОбласть("Шапка");
		
		// Когда нужен только заголовок:
		Если ТолькоЗаголовок Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВысотаЗаголовка) Тогда
			ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаНач",     НачалоДня(ДатаНач));
		Запрос.УстановитьПараметр("ДатаКон",     КонецДня(ДатаКон));
		Запрос.УстановитьПараметр("Организация", Организация);
		
		ОграниченияПоПостроителюОтчета = БухгалтерскиеОтчеты.ПолучитьТекстОграниченийПоПостроителюОтчета(ПостроительОтчета, Запрос);
		
		Если Не ПустаяСтрока(ОграниченияПоПостроителюОтчета) Тогда
			
			ОграниченияПоПостроителюОтчета = " И " + ОграниченияПоПостроителюОтчета;
			
		КонецЕсли;
		
		Запрос.Текст = СформироватьТекстЗапроса();
		
		Запрос.Текст  = СтрЗаменить(Запрос.Текст, ".Активность",".Активность " + ОграниченияПоПостроителюОтчета);
		
		Результат = Запрос.Выполнить();
		
		ОбластьШапка            = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока           = Макет.ПолучитьОбласть("Строка");
		ОбластьИтого            = Макет.ПолучитьОбласть("Итого");
		ОбластьОкончаниеТаблицы = Макет.ПолучитьОбласть("ОкончаниеТаблицы");
		
		ОбластьПодвал             = МакетОбщий.ПолучитьОбласть("Подвал");
		
		ВыборкаПериод = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Всего = 0;
		
		Пока ВыборкаПериод.Следующий() Цикл
			
			ЗаголовокОтчета.Параметры.Период              = "" + ПредставлениеПериода(НачалоМесяца(ВыборкаПериод.Период), КонецМесяца(ВыборкаПериод.Период), "ФП = Истина");
			ЗаголовокОтчета.Параметры.НазваниеОрганизации = "" + Организация.НаименованиеПолное;
			ЗаголовокОтчета.Параметры.ДатаСоставления     = КонецМесяца(ВыборкаПериод.Период);
			ЗаголовокОтчета.Параметры.НазваниеОтчета      = НСтр("ru='Переоценка активов и обязательств, выраженных в иностранной валюте';uk=""Переоцінка активів і зобов'язань, що виражені в іноземній валюті""", КодЯзыкаПечать);
			ДокументРезультат.Вывести(ЗаголовокОтчета);
			
			СтрОтбор = УправлениеОтчетами.СформироватьСтрокуОтборов(ПостроительОтчета.Отбор);
			Если Не ПустаяСтрока(СтрОтбор) Тогда
				ОбластьОтбор = МакетОбщий.ПолучитьОбласть("СтрокаОтбор");
				ОбластьОтбор.Параметры.ТекстПроОтбор = НСтр("ru='Отбор: ';uk='Відбір: '", КодЯзыкаПечать) + СтрОтбор;
				ДокументРезультат.Вывести(ОбластьОтбор);
			КонецЕсли;
			
			// Параметр для показа заголовка
			ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;
			
			ДокументРезультат.Вывести(ШапкаОтчета);
			
			ИтогСуммаДо         = 0;
			ИтогПереоценка      = 0;
			ИтогПереоценкаПлюс  = 0;
			ИтогПереоценкаМинус = 0;				
			
			ВыборкаСчетУчета = ВыборкаПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаСчетУчета.Следующий() Цикл
				
				ВыборкаВалюта = ВыборкаСчетУчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаВалюта.Следующий() Цикл
					
					Выборка = ВыборкаВалюта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока Выборка.Следующий() Цикл
						
						ОбластьСтрока.Параметры.Валюта = Выборка.Валюта;
						ОбластьСтрока.Параметры.Субконто1 = Выборка.Субконто1;
						ОбластьСтрока.Параметры.Субконто2 = Выборка.Субконто2;
						ОбластьСтрока.Параметры.Субконто3 = Выборка.Субконто3;
						ОбластьСтрока.Параметры.СчетУчета = Выборка.СчетУчета;
						ОбластьСтрока.Параметры.СуммаВвалюте = Выборка.СуммаВвалюте;
						ОбластьСтрока.Параметры.СуммаВГривнах = Выборка.СуммаВГривнах;
						ОбластьСтрока.Параметры.Курс = Выборка.КурсПереоценки;
						
						Переоценка = Выборка.Сумма;
						ПереоценкаПлюс  = ?(Переоценка > 0, Переоценка, 0);
						ПереоценкаМинус = ?(Переоценка < 0, - Переоценка, 0);
						ОбластьСтрока.Параметры.СуммаВГривнахПослеПереоценки = Выборка.СуммаВГривнах + Переоценка;
						ОбластьСтрока.Параметры.Переоценка = Переоценка;
						ОбластьСтрока.Параметры.ПереоценкаПллюс = ПереоценкаПлюс;
						ОбластьСтрока.Параметры.ПереоценкаМинус = ПереоценкаМинус;
						
						ДокументРезультат.Вывести(ОбластьСтрока);
												
						ИтогСуммаДо         = ИтогСуммаДо + Выборка.СуммаВГривнах;
						ИтогПереоценка      = ИтогПереоценка + Переоценка;
						ИтогПереоценкаПлюс  = ИтогПереоценкаПлюс + ПереоценкаПлюс;
						ИтогПереоценкаМинус = ИтогПереоценкаМинус + ПереоценкаМинус;
						
						
					КонецЦикла; 
				КонецЦикла;   // валюта
			КонецЦикла;  // счет учета
			
			ОбластьИтого.Параметры.СуммаДО         = ИтогСуммаДо;
			ОбластьИтого.Параметры.СуммаПосле      = ИтогСуммаДо + ИтогПереоценка;
			ОбластьИтого.Параметры.Переоценка      = ИтогПереоценка;
			ОбластьИтого.Параметры.ПереоценкаМинус = ИтогПереоценкаМинус;
			ОбластьИтого.Параметры.ПереоценкаПлюс  = ИтогПереоценкаПлюс;
			ДокументРезультат.Вывести(ОбластьИтого);
			
			ДокументРезультат.Вывести(ОбластьОкончаниеТаблицы);
			
			ДокументРезультат.Вывести(ОбластьПодвал);
			
			ВысотаПодписи = ДокументРезультат.Области.Подвал.Низ - ДокументРезультат.Области.Подвал.Верх;
			
			ДокументРезультат.Области.Подвал.Видимость = ПоказыватьПодписи;
			
		КонецЦикла;    // Период	
		
		// Зафиксируем заголовок отчета
			ДокументРезультат.ФиксацияСверху = 10;
		
		// Первую колонку не печатаем
		ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
		
		// Присвоим имя для сохранения параметров печати табличного документа
		ДокументРезультат.ИмяПараметровПечати = НСтр("ru='Переоценка активов и обязательств, выраженных в иностранной валюте';uk=""Переоцінка активів і зобов'язань, що виражені в іноземній валюті""", КодЯзыкаПечать);
		
		УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(ДокументРезультат, ЗаголовокОтчета, Строка(глЗначениеПеременной("глТекущийПользователь")));
		
	КонецПроцедуры // СформироватьОтчет
	
	
	////////////////////////////////////////////////////////////////////////////////
	// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
	// 
	
	НП = Новый НастройкаПериода;
	
#КонецЕсли
